{
  "projects": [
    {
      "name": "NextGen Scholars",
      "skills": [
        "HTML",
        "CSS",
        "EJS",
        "JavaScript",
        "Mongodb",
        "Node.js",
        "ExpressJS",
        "Mongoose"
      ],
      "about": "NextGen Scholars is a website designed to help middle and high school students with access to college resources. The website allows the student to create their personalized profile and offers various activities within a four-year plan designed with the student in mind. Additionally, the student can use the site purely as an informational database about college prep, leveraging our numerous subpages located in the footer. As an added bonus for parents and educators, an educator profile is offered to allow adults to view their students' profiles. Website URL: nextgen-scholars.vercel.app",
      "technical": "NextGen Scholars was created using HTML, CSS, EJS, and JavaScript in the frontend. In the backend, we employed backend JavaScript with Node.js and ExpressJS. ExpressJS facilitated the routing of our website with the server. As our database we used Mongodb with Mongoose. Most of these technologies were foreign to our group prior to this project, which meant we had to comb through pages of documentation on how to use them.",
      "github": "https://github.com/declanmckoen/NextGen-Scholars",
      "pictures": [
        "/portfolio/pictures/nextgen-scholars/homepage.png",
        "/portfolio/pictures/nextgen-scholars/signup.png",
        "/portfolio/pictures/nextgen-scholars/student.png",
        "/portfolio/pictures/nextgen-scholars/educator.png"
      ],
      "id": "nextgen-scholars"
    },
    {
      "name": "Board Buddy",
      "skills": [
        "C++",
        "Regex"
      ],
      "about": "Board Buddy is an ambitious project designed to provide chess players with an avenue to improvement without the need for a credit card. Our group parsed at least 100,000 played chess games on a Lichess database. Users can enter in their chess game using algebraic chess notation, and our algorithm will generate a list of games that are most similar to the inputted game based on a calculated similarity score. Users can then view the most similar games and learn from the mistakes of others.",
      "technical": "Board Buddy was created purely using C++ as the main language. We used C++ for the backend similarity score algorithm as well as the frontend terminal-based interface. Our group took advantage of the C++ regex to help parse through the Lichess database.",
      "github": "https://github.com/declanmckoen/BoardBuddy",
      "pictures": [
        "/portfolio/pictures/board-buddy/home.png",
        "/portfolio/pictures/board-buddy/input.png",
        "/portfolio/pictures/board-buddy/result.png"
      ],
      "id": "board-buddy"
    },
    {
      "name": "Minesweeper",
      "skills": [
        "C++",
        "SFML"
      ],
      "about": "This Minesweeper clone is almost an exact replica of the childhood favorite of mine. I pleased to be able to learn more about graphical user interfaces and how to tailor my projects for the overall best user experience.",
      "technical": "My Minesweeper clone was created using C++ as the primary language. C++ was responsible for the backend board generation and recursive traversal through the squares on the board. I leveraged the Simple Fast Multimedia Library (SFML) to design the graphical user interface.",
      "github": "https://github.com/declanmckoen/Minesweeper-Project",
      "pictures": [
        "/portfolio/pictures/minesweeper/homepage.png",
        "/portfolio/pictures/minesweeper/gameplay.png",
        "/portfolio/pictures/minesweeper/loss.png",
        "/portfolio/pictures/minesweeper/leaderboard.png"
      ],
      "id": "minesweeper"
    },
    {
      "name": "Sudoku",
      "skills": [
        "Python",
        "PyGame"
      ],
      "about": "This Sudoku clone, like my Minesweeper project, is a replica of the popular problem-solving game. This project revealed my passion for creating video games since I got to see the intricacies that go into creating even the simplest video games like Sudoku.",
      "technical": "Sudoku was my first introduction to a GUI. It taught me the basics of error handling, object-oriented programming, and user experience design. This project was completed using Python as the backend language. It utilized the popular Python library, PyGame, for the graphical user interface.",
      "github": "https://github.com/declanmckoen/Sudoku",
      "pictures": [
        "/portfolio/pictures/sudoku/homepage.png",
        "/portfolio/pictures/sudoku/gameplay.png"
      ],
      "id": "sudoku"
    },
    {
      "name": "Portfolio",
      "skills": [
        "HTML",
        "CSS",
        "React"
      ],
      "about": "This portfolio project has been my favorite project to create since it explicitly and implicitly reveals the skills in which I am adept. I am able to showcase my design-oriented mindset and my experience in full-stack development. Ultimately, I hope this project tells you, the reader, more about me as a person.",
      "technical": "I decided to build my own portfolio website (the one you're in right now) from scratch using HTML, CSS, JavaScript, and React. Just prior to this project, I had little to no experience with frontend development at all. I spent long nights grinding through YouTube tutorials and online courses until I finally felt prepared enough to tackle this undertaking. Realistically, though, I still need a lot of improvement and am always looking for ways to enhance my abilities.",
      "github": "https://github.com/declanmckoen/Sudoku",
      "pictures": [],
      "id": "portfolio"
    }
  ],

  "skills": {
    "frontend": [
      "HTML",
      "CSS",
      "JavaScript",
      "React",
      "EJS"
    ],
    "backend": [
      "Python",
      "C/C++",
      "Java",
      "MATLAB",
      "ARM Assembly",
      "Mongodb",
      "ExpressJS",
      "Node.js"
    ],
    "developerTools": [
      "Amazon Web Services (AWS)",
      "Agile Scrum Development",
      "Atlassian Jira",
      "JUnit 5 Testing Framework",
      "Catch2 Testing Framework"
    ],
    "libraries": [
      "PyGame",
      "SFML",
      "Regex",
      "Pandas",
      "Numpy",
      "Sci-kit Learn"
    ]
  }
}